Revit 2024 API
PipeFittingAndAccessoryData.GetAllConnectorData Method
 Gets the connector data of the pipe fitting or pipe accessory.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public IList<PipeFittingAndAccessoryConnectorData> GetAllConnectorData()
Visual Basic
Public Function GetAllConnectorData As IList(Of PipeFittingAndAccessoryConnectorData)
Visual C++
public:
IList<PipeFittingAndAccessoryConnectorData^>^ GetAllConnectorData()
Return Value
 All connector data.
Remarks
 PipeFittingAndAccessoryConnectorData contains connector data which is needed to calculate coefficient. such as width, height, diameter and flow.
See Also
PipeFittingAndAccessoryData Class
Autodesk.Revit.DB.Plumbing Namespace